title: Suspicious Regasm or Regsvcs Remote Registration
id: f82a87c6-349b-4d7f-8c30-9ad67f731a5c
status: experimental
description: Detects potentially malicious use of regasm.exe or regsvcs.exe to register .NET assemblies from remote locations or network shares, which can be abused for persistence or privilege escalation.
author: vVv-Keys
date: 2026/01/17
references:
  - https://attack.mitre.org/techniques/T1121/  # Signed Binary Proxy Execution: regsvcs/regasm
  - https://learn.microsoft.com/en-us/dotnet/framework/tools/regasm-exe-assembly-registration-tool
  - https://learn.microsoft.com/en-us/dotnet/framework/tools/regsvcs-exe-application-service-installer-tool
logsource:
  product: windows
  category: process_creation
detection:
  selection_image:
    Image|endswith:
      - '\\regasm.exe'
      - '\\regsvcs.exe'
  selection_remote:
    CommandLine|contains:
      - '\\\\'
      - 'http://'
      - 'https://'
  selection_flags:
    CommandLine|contains:
      - '/codebase'
      - '/u'
      - '/nologo'
  condition: selection_image and selection_remote
falsepositives:
  - Legitimate .NET assembly registration from trusted remote locations or deployment scripts.
level: high
tags:
  - attack.execution
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1121
