title: Suspicious At.exe Remote Scheduled Job
id: c83b7df2-9ed0-45f0-b95f-8a74595a367e
status: experimental
description: Detects the use of at.exe to schedule tasks on remote hosts, which may indicate lateral movement or persistence.
author: vVv-Keys
date: 2026/01/17
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/at
    - https://attack.mitre.org/techniques/T1053/002/
logsource:
    product: windows
    category: process_creation
detection:
    selection_image:
        Image|endswith: '\\at.exe'
    selection_remote:
        CommandLine|contains:
            - '\\\\'
            - '/S'
    condition: selection_image and selection_remote
falsepositives:
    - Legitimate scheduled job creation on remote systems by administrators
level: medium
tags:
    - attack.lateral_movement
    - attack.persistence
    - attack.t1053.002
    - attack.execution
