title: Suspicious Mshta Remote Script Execution
id: c793a64c-b6b9-4e5a-8c83-061cbe735e83
status: experimental
description: Detects mshta.exe launching remote or script file from a URL or using the javascript/vbscript schemes, which may indicate remote code execution.
author: vVv-Keys
date: 2026/01/17
references:
  - https://attack.mitre.org/techniques/T1218/005/
  - https://learn.microsoft.com/en-us/windows/win32/dataxchg/html-applications
logsource:
  product: windows
  category: process_creation
detection:
  selection_image:
    Image|endswith:
      - '\\mshta.exe'
  selection_remote:
    CommandLine|contains:
      - 'http://'
      - 'https://'
      - '\\\\'
  selection_scheme:
    CommandLine|contains:
      - 'javascript:'
      - 'vbscript:'
  condition: selection_image and (selection_remote or selection_scheme)
falsepositives:
  - Legitimate use of mshta.exe to execute local HTML applications or system scripts
level: medium
tags:
  - attack.defense_evasion
  - attack.t1218.005
  - attack.execution
