title: Suspicious NLTest Domain Trust Enumeration
id: 674ece20-2aae-4aec-b047-951b786ac0f9
status: experimental
description: Detects use of nltest command to enumerate domain controllers, domain trusts, or domain lists.
author: vVv-Keys
date: 2026/01/17
references:
  - https://attack.mitre.org/techniques/T1482
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/nltest
logsource:
  product: windows
  category: process_creation
detection:
  selection_dsgetdc:
    CommandLine|contains|all:
      - 'nltest'
      - '/dsgetdc:'
  selection_dclist:
    CommandLine|contains|all:
      - 'nltest'
      - '/dclist:'
  selection_enum_trusts:
    CommandLine|contains|all:
      - 'nltest'
      - '/enum_trusts'
  condition: selection_dsgetdc or selection_dclist or selection_enum_trusts
falsepositives:
  - Legitimate domain admin enumeration tasks
level: medium
tags:
  - attack.discovery
  - attack.t1482
